#Область ОбработчикСобытийЭлементовФормы

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчетСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчетСуммы();
КонецПроцедуры

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчетСуммы()
	Перем ТекущаяСтрока;
	ТекущаяСтрока = Элементы.Товары.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда 
		РаботаСДокументами.РассчитатьСумму(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
